jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32LCD8.cpp
        l = xferLen - 2;
        l <<= 1;
        for (uint32_t i = 0; i < l;)
        {
            _data16.value = *data++;
            _buffer[i++]  = _data16.msb;
            _buffer[i++]  = _data16.lsb;
        }

        *(uint32_t *)_dmadesc = ((l + 3) & (~3)) | l << 12 | 0xC0000000;
        _dmadesc->buffer      = _buffer32;
        _dmadesc->next        = nullptr;
        gdma_start(_dma_chan, (intptr_t)(_dmadesc));
        LCD_CAM.lcd_cmd_val.val = _data32.value;
        LCD_CAM.lcd_user.val    = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG;

        len -= xferLen;

        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_START;
    }

    while (len--)
    {
        _data16.value                     = *data++;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.msb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.lsb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
    }
}

/**
 * @brief writeBytes
 *
 * @param data
 * @param len
 */
void Arduino_ESP32LCD8::writeBytes(uint8_t *data, uint32_t len)
{
    uint32_t xferLen, l;

    if (esp_ptr_dma_capable(data))
    {
        while (len > (USE_DMA_THRESHOLD << 1))  // While pixels remain
        {
            xferLen = (len >= LCD_MAX_PIXELS_AT_ONCE << 1) ? (LCD_MAX_PIXELS_AT_ONCE << 1) : len;  // How many this pass?

            _data32.value = 0;
            _data32.lsb   = *data++;
            _data32.lsb_2 = *data++;

            LCD_CAM.lcd_cmd_val.val = _data32.value;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;

            _data32.value = 0;
            _data32.lsb   = *data++;
            _data32.lsb_2 = *data++;

            l                     = xferLen - 4;
            *(uint32_t *)_dmadesc = ((l + 3) & (~3)) | l << 12 | 0xC0000000;
            _dmadesc->buffer      = data;
            _dmadesc->next        = nullptr;
            gdma_start(_dma_chan, (intptr_t)(_dmadesc));
            LCD_CAM.lcd_cmd_val.val = _data32.value;
            LCD_CAM.lcd_user.val    = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG;

            data += xferLen - 4;
            len -= xferLen;

            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_START;
        }
    }
    else
    {
        uint32_t  l4;
        uint32_t *p;
        while (len > (USE_DMA_THRESHOLD << 1))  // While pixels remain
        {
            xferLen = (len >= LCD_MAX_PIXELS_AT_ONCE << 1) ? (LCD_MAX_PIXELS_AT_ONCE << 1) : len;  // How many this pass?

            _data32.value = 0;
            _data32.lsb   = *data++;
            _data32.lsb_2 = *data++;

            LCD_CAM.lcd_cmd_val.val = _data32.value;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;

            _data32.value = 0;
            _data32.lsb   = *data++;
            _data32.lsb_2 = *data++;

            l = xferLen - 4;

            l4 = (l + 3) >> 2;
            p  = (uint32_t *)data;
            for (uint32_t i = 0; i < l4; i++)
            {
                _buffer32[i] = *p++;
            }

            *(uint32_t *)_dmadesc = ((l + 3) & (~3)) | l << 12 | 0xC0000000;
            _dmadesc->buffer      = _buffer32;
            _dmadesc->next        = nullptr;
            gdma_start(_dma_chan, (intptr_t)(_dmadesc));
            LCD_CAM.lcd_cmd_val.val = _data32.value;
            LCD_CAM.lcd_user.val    = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG;

            data += xferLen - 4;
            len -= xferLen;

            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_START;
        }
    }

    while (len)
    {
        if (len == 1)
        {
            LCD_CAM.lcd_cmd_val.lcd_cmd_value = *data;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
            len--;
        }
        else
        {
            LCD_CAM.lcd_cmd_val.lcd_cmd_value = *data++;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
            LCD_CAM.lcd_cmd_val.lcd_cmd_value = *data++;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;

            len -= 2;
        }
    }
}

/**
 * @brief writeIndexedPixels
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32LCD8::writeIndexedPixels(uint8_t *data, uint16_t *idx, uint32_t len)
{
    if (len > USE_DMA_THRESHOLD)
    {
        uint32_t bufLen = (len < LCD_MAX_PIXELS_AT_ONCE) ? len : LCD_MAX_PIXELS_AT_ONCE;
        uint32_t xferLen, l;

        while (len > USE_DMA_THRESHOLD)
        {
            xferLen = (bufLen <= len) ? bufLen : len;  // How many this pass?

            _data16.value = idx[*data++];
            _data32.value = 0;
            _data32.lsb   = _data16.msb;
            _data32.lsb_2 = _data16.lsb;

            LCD_CAM.lcd_cmd_val.val = _data32.value;
            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;

            _data16.value = idx[*data++];
            _data32.value = 0;
            _data32.lsb   = _data16.msb;
            _data32.lsb_2 = _data16.lsb;

