jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32LCD8.cpp
            l = xferLen - 2;
            l >>= 1;
            for (uint32_t i = 0; i < l; i++)
            {
                _data16.value = idx[*data++];
                _data32.lsb   = _data16.msb;
                _data32.msb   = _data16.lsb;
                _data16.value = idx[*data++];
                _data32.lsb_2 = _data16.msb;
                _data32.msb_2 = _data16.lsb;
                _buffer32[i]  = _data32.value;
            }

            l <<= 2;
            *(uint32_t *)_dmadesc = ((l + 3) & (~3)) | l << 12 | 0xC0000000;
            _dmadesc->buffer      = _buffer;
            _dmadesc->next        = nullptr;
            gdma_start(_dma_chan, (intptr_t)(_dmadesc));
            LCD_CAM.lcd_cmd_val.val = _data32.value;
            LCD_CAM.lcd_user.val    = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_UPDATE_REG;

            len -= xferLen;

            WAIT_LCD_NOT_BUSY;
            LCD_CAM.lcd_user.val = LCD_CAM_LCD_ALWAYS_OUT_EN | LCD_CAM_LCD_DOUT | LCD_CAM_LCD_CMD | LCD_CAM_LCD_CMD_2_CYCLE_EN | LCD_CAM_LCD_START;
        }
    }

    while (len--)
    {
        _data16.value                     = idx[*data++];
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.msb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.lsb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
    }
}

/**
 * @brief writeIndexedPixelsDouble
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32LCD8::writeIndexedPixelsDouble(uint8_t *data, uint16_t *idx, uint32_t len)
{
    while (len--)
    {
        _data16.value                     = idx[*data++];
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.msb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.lsb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.msb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val              = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
        LCD_CAM.lcd_cmd_val.lcd_cmd_value = _data16.lsb;
        WAIT_LCD_NOT_BUSY;
        LCD_CAM.lcd_user.val = LCD_CAM_LCD_CMD | LCD_CAM_LCD_UPDATE_REG | LCD_CAM_LCD_START;
    }
}

/******** low level bit twiddling **********/

/**
 * @brief CS_HIGH
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32LCD8::CS_HIGH(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortSet = _csPinMask;
    }
}

/**
 * @brief CS_LOW
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32LCD8::CS_LOW(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortClr = _csPinMask;
    }
}

    #else  // (ESP_ARDUINO_VERSION_MAJOR >= 3)

/**
 * @brief Construct a new Arduino_ESP32LCD8::Arduino_ESP32LCD8 object
 */
Arduino_ESP32LCD8::Arduino_ESP32LCD8(int8_t dc, int8_t cs, int8_t wr, int8_t rd, int8_t d0, int8_t d1, int8_t d2, int8_t d3, int8_t d4, int8_t d5, int8_t d6, int8_t d7)
    : _dc(dc)
    , _cs(cs)
    , _wr(wr)
    , _rd(rd)
    , _d0(d0)
    , _d1(d1)
    , _d2(d2)
    , _d3(d3)
    , _d4(d4)
    , _d5(d5)
    , _d6(d6)
    , _d7(d7)
{
}

/**
 * @brief begin
 */
bool Arduino_ESP32LCD8::begin(int32_t speed, int8_t dataMode)
{
    if (speed == GFX_NOT_DEFINED)
    {
        _speed = 20000000UL;  // safe frequency
    }
    else
    {
        _speed = speed;
    }

    if (_cs != GFX_NOT_DEFINED)
    {
        pinMode(_cs, OUTPUT);
        digitalWrite(_cs, HIGH);  // disable chip select
    }

    pinMode(_wr, OUTPUT);
    digitalWrite(_wr, HIGH);  // Set write strobe high (inactive)

    if (_rd != GFX_NOT_DEFINED)
    {
        pinMode(_rd, OUTPUT);
        digitalWrite(_rd, HIGH);
    }

    esp_lcd_i80_bus_config_t bus_config = {
      .dc_gpio_num        = _dc,
      .wr_gpio_num        = _wr,
      .clk_src            = LCD_CLK_SRC_PLL160M,  // ??? LCD_CLK_SRC_DEFAULT,
      .data_gpio_nums     = {_d0, _d1, _d2, _d3, _d4, _d5, _d6, _d7},
      .bus_width          = 8,
      .max_transfer_bytes = LCD_MAX_PIXELS_AT_ONCE * 2,
      .dma_burst_size     = 64,
      // .sram_trans_align = 4
    };
    esp_lcd_new_i80_bus(&bus_config, &_i80_bus);

    // Serial.printf("max_transfer_bytes=%zu\n", bus_config.max_transfer_bytes);

    esp_lcd_panel_io_i80_config_t io_config = {
      .cs_gpio_num       = _cs,
      .pclk_hz           = (uint32_t)_speed,
      .trans_queue_depth = 10,
      // on_color_trans_done = nullptr,
      // user_ctx = nullptr,
      .lcd_cmd_bits   = 8,
      .lcd_param_bits = 8,
      .dc_levels =
        {
          .dc_idle_level  = 0,
          .dc_cmd_level   = 0,
          .dc_dummy_level = 0,
          .dc_data_level  = 1,
        },
      .flags =
        {
          .swap_color_bytes = 0,
          .pclk_idle_low    = 0,
        },
    };
    esp_lcd_new_panel_io_i80(_i80_bus, &io_config, &_io_handle);

    // allocate some DMA buffer
    _cmd       = -1;
    _isColor   = false;
    _bufferLen = 0;
    _buffer    = (uint8_t *)esp_lcd_i80_alloc_draw_buffer(_io_handle, LCD_MAX_PIXELS_AT_ONCE * 2 + 16, MALLOC_CAP_DMA);

    return (_buffer != nullptr);
}

/**
 * @brief start any command or data sequence
 */
void Arduino_ESP32LCD8::beginWrite()
{
    _cmd       = -1;
    _bufferLen = 0;
}

/**
 * @brief end any command or data sequence
 */
void Arduino_ESP32LCD8::endWrite() { flushBuffer(); }

/**
 * @brief write a byte command
 * @param c the command byte
 */
void Arduino_ESP32LCD8::writeCommand(uint8_t c)
{
    flushBuffer();
    // Serial.printf("writeCommand(%02x)\n", c);
    _cmd     = c;
    _isColor = false;
}

/**
 * @brief write a word command
 * @param c the command word
 */
void Arduino_ESP32LCD8::writeCommand16(uint16_t c)
{
    // Serial.printf("ESP32LCD8::writeCommand16 not implemented.\n");
}

/** write a set of data as command + params */
void Arduino_ESP32LCD8::writeCommandBytes(uint8_t *data, uint32_t len)
{
    flushBuffer();
    // Serial.printf("**writeCommandBytes()\n");

