jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32LCD8.cpp
    if (len)
    {
        _cmd     = *data++;
        _isColor = false;
        len--;
    }

    while (len)
    {
        write(*data++);
        len--;
    }
}

/**
 * @brief write a byte to the param buffer.
 * @param d data byte
 */
void Arduino_ESP32LCD8::write(uint8_t d)
{
    _buffer[_bufferLen++] = d;
    if (_bufferLen >= LCD_MAX_PIXELS_AT_ONCE * 2)
    {
        flushBuffer();
    }
}

/**
 * @brief write16 - write 16-bit to the param buffer.
 * @param d data word
 */
void Arduino_ESP32LCD8::write16(uint16_t d)
{
    _data16.value         = d;
    _buffer[_bufferLen++] = _data16.msb;
    _buffer[_bufferLen++] = _data16.lsb;

    if (_bufferLen >= LCD_MAX_PIXELS_AT_ONCE * 2 - 4)
    {
        flushBuffer();
    }
}

/**
 * @brief writeRepeat
 *
 * @param p
 * @param len
 */
void Arduino_ESP32LCD8::writeRepeat(uint16_t p, uint32_t len)
{
    // Serial.printf("  writeRepeat(#%04x, %d)\n", p, len);
    _isColor = true;

    while (len--)
    {
        write16(p);
    }

    // // fill buffer
    // uint32_t buf16Len = (len > LCD_MAX_PIXELS_AT_ONCE) ? LCD_MAX_PIXELS_AT_ONCE : len;
    // _buffer[0] = p >> 8;
    // _buffer[1] = p & 0x00ff;
    // uint16_t c16 = _buffer16[0];
    // for (uint32_t i = 0; i < buf16Len; i++)
    // {
    //   _buffer16[i] = c16;
    // }

    // while (len > 0)
    // { // while there are still pixels to write
    //   uint32_t txlen16 = (len > LCD_MAX_PIXELS_AT_ONCE) ? LCD_MAX_PIXELS_AT_ONCE : len;
    //   _bufferLen = txlen16 * 2;
    //   flushBuffer();
    //   len -= txlen16;
    // }
}

/**
 * @brief write Pixel data words to the buffer.
 * @param data array of Pixel data words
 * @param len length of data array
 */
void Arduino_ESP32LCD8::writePixels(uint16_t *data, uint32_t len)
{
    // Serial.printf("  writePixels( [...], %ld)\n", len);
    _isColor = true;

    // transfer in chunks
    while (len--)
    {
        write16(*data++);
    }
}

/**
 * @brief write data bytes to the buffer
 * @param data array of data bytes
 * @param len length of data array
 */
void Arduino_ESP32LCD8::writeBytes(uint8_t *data, uint32_t len)
{
    // Serial.printf("  writeBytes( [...], %ld)\n", len);
    // transfer in chunks
    while (len--)
    {
        write(*data++);
    }
}

/**
 * @brief writeIndexedPixels
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32LCD8::writeIndexedPixels(uint8_t *data, uint16_t *idx, uint32_t len)
{
    // Serial.printf("**writeIndexedPixels(...)\n");
}

/**
 * @brief writeIndexedPixelsDouble
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32LCD8::writeIndexedPixelsDouble(uint8_t *data, uint16_t *idx, uint32_t len)
{
    // Serial.printf("**writeIndexedPixelsDouble(...)\n");
}

// ===== sending the buffer =====

// for details, see
// <https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/lcd/index.html>

void Arduino_ESP32LCD8::flushBuffer()
{
    if (_cmd == 0x2c)
    {
        if (!_isColor)
            _isColor = true;
    }

    if ((_cmd >= 0) || (_bufferLen > 0))
    {
        // Serial.printf("  flush(%02x: (%d)", _cmd, _bufferLen);

        // for (int n = 0; (n < _bufferLen) && (n < 32); n++)
        // {
        //   Serial.printf(" %02x", _buffer[n]);
        // }

        // wait for color completion (when color sending is on the way)
        // send cmd and buffer and wait for completion

        if (_isColor)
        // if (_bufferLen > 32)
        // if (_cmd == 0x2c9)
        {
            // async DMA transfer
            esp_lcd_panel_io_tx_color(_io_handle, _cmd, _buffer, _bufferLen);
        }
        else
        {
            esp_lcd_panel_io_tx_param(_io_handle, _cmd, _buffer, _bufferLen);
        }
        // if (!_bufferLen)
        // {
        //   _cmd = -1; // next time, we start a data send out without command.
        // }
        _cmd       = -1;  // next time, we start a data send out without command.
        _bufferLen = 0;
        // Serial.println(")");
    }
}

    #endif  // #if (!defined(ESP_ARDUINO_VERSION_MAJOR)) || (ESP_ARDUINO_VERSION_MAJOR < 3)
#endif      // #if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32S3)
